Ran Plan for dir: `vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_compute_firewall.atlantis_test_firewall will be created
+ resource "google_compute_firewall" "atlantis_test_firewall" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "atlantis-test"
      + network            = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-demo-network"
      + priority           = 1000
      + project            = "premium-guide-403909"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc_network will be destroyed
  # (because google_compute_network.vpc_network is not in configuration)
- resource "google_compute_network" "vpc_network" {
      - auto_create_subnetworks                   = false -> null
      - delete_default_routes_on_create           = false -> null
      - enable_ula_internal_ipv6                  = false -> null
      - id                                        = "projects/premium-guide-403909/global/networks/atlantis-test-network" -> null
      - mtu                                       = 0 -> null
      - name                                      = "atlantis-test-network" -> null
      - network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL" -> null
      - project                                   = "premium-guide-403909" -> null
      - routing_mode                              = "REGIONAL" -> null
      - self_link                                 = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-test-network" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.118.115.250/lock?id=devabolmasov%252Fatlantis%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`